// 'number' + 3 + 3
//  Спочатку відбувається конкатенація рядка 'number' з числом 3, що дає 'number3'. Потім до цього рядка додається ще один 3, отримуємо 'number33'.
console.log('number' + 3 + 3); // "number33"

// null + 3
//  null перетворюється в 0, і результатом буде 3.
console.log(null + 3); // 3

// 5 && "qwerty"
//  Оператор && повертає останнє значення, якщо обидва операнди правдиві. Тут це буде "qwerty".
console.log(5 && "qwerty"); // "qwerty"

// +'40' + +'2' + "hillel"
//  +'40' та +'2' перетворюються в числа (40 і 2), їх результат додається (42). Потім до цього додається рядок "hillel", що дає "42hillel".
console.log(+'40' + +'2' + "hillel"); // "42hillel"

// '10' - 5 === 6
//  Оператор - виконує арифметичне віднімання, тому '10' перетворюється в число 10, і 10 - 5 дає 5, що порівнюється з 6 (не рівно).
console.log('10' - 5 === 6); // false

// true + false
//  true перетворюється на 1, false - на 0, тому результат буде 1.
console.log(true + false); // 1

// '4px' - 3
//  Операція мінус не може бути виконана з рядком, тому результатом буде NaN (Not a Number).
console.log('4px' - 3); // NaN

// '4' - 3
//  '4' перетворюється в число 4, і результатом буде 1.
console.log('4' - 3); // 1

// '6' + 3 ** 0
//  Оператор  виконує піднесення до степеня, 3  0 дає 1, і до цього додається рядок '6', результат - '61'.
console.log('6' + 3 ** 0); // "61"

// 12 / '6'
//  '6' перетворюється на число, результатом буде 2.
console.log(12 / '6'); // 2

// '10' + (5 === 6)
//  5 === 6 дає false, але оскільки це буде конкатеновано з рядком '10', результатом буде '10false'.
console.log('10' + (5 === 6)); // "10false"

// null == ''
//  null та '' не рівні між собою.
console.log(null == ''); // false

// 3 ** (9 / 3)
//  9 / 3 дає 3, і 3 ** 3 дає 27.
console.log(3 ** (9 / 3)); // 27

// !!'false' == !!'true'
//  !!'false' та !!'true' обидва дають true, тому результат буде true.
console.log(!!'false' == !!'true'); // true

// 0 || '0' && 1
//  Спочатку виконується операція &&, '0' перетворюється в true, і 1 повертається. Потім 0 || 1 дає 1.
console.log(0 || '0' && 1); // 1

// (+null == false) < 1
//  +null дає 0, тому (0 == false) дає true, що менше за 1.
console.log((+null == false) < 1); // true

// false && true || true
//  false && true дає false, а потім false || true дає true.
console.log(false && true || true); // true

// false && (false || true)
//  false && (false || true) дає false.
console.log(false && (false || true)); // false

// (+null == false) < 1 ** 5
//  1 ** 5 дає 1, і (0 == false) дає true, тому результат буде true < 1, що дає true.
console.log((+null == false) < 1 ** 5); // true